package com.osmile.russiablockgame;



//用来表示各种方块集（4x4）
public class Blocks {
    protected static int blocksint[][][][] = {  //blocksint[哪种方块集合][方块状态]   [][]方块组合图
            //大长条  blocksint四维数组

            //blocksint[0][][][] 第一维度为0表示 大长条，后续有两种方块形态
            {
                    //第1维表示哪种方块集合  第2维表示方块状态  第3、4维表示方块组合图
                    //第1维度：0.大长条 1.大四格 2.L方块  3.反L方块 4.S方块 5.反S方块 6.凸方块

                    //大长条状态1
                    //blocksint[0][0][][]大长条状态1
                    {
                            {0,1,0,0},
                            {0,1,0,0},
                            {0,1,0,0},
                            {0,1,0,0}
                    },
                    //大长条状态2
                    //blocksint[0][1][][]大长条状态2
                    {
                            {0,0,0,0},
                            {1,1,1,1},
                            {0,0,0,0},
                            {0,0,0,0}
                    }

            },
            //大四格方块
            //blocksint[1][][][] 第一维度为1表示 大四方块，后续只有1种方块形态
            {
                    //四格方块状态1
                    //blocksint[1][0][][]
                    {
                            {1,1,0,0},
                            {1,1,0,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    }
            },

            //L方块
            //blocksint[2][][][] 第一维度为2表示 L方块，后续有4种方块形态
            {
                    //L方块状态1
                    //blocksint[2][0][][]
                    {
                            {1,0,0,0},
                            {1,0,0,0},
                            {1,1,0,0},
                            {0,0,0,0}
                    },
                    //L方块状态2
                    //blocksint[2][1][][]
                    {
                            {1,1,1,0},
                            {1,0,0,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    },
                    //L方块状态3
                    //blocksint[2][2][][]
                    {
                            {1,1,0,0},
                            {0,1,0,0},
                            {0,1,0,0},
                            {0,0,0,0}
                    },
                    //L方块状态4
                    //blocksint[2][3][][]
                    {
                            {0,0,1,0},
                            {1,1,1,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    }
            },
            //反L方块
            //blocksint[3][][][] 第一维度为表示3, 反L方块，后续有4种方块形态
            {
                    //反L方块状态1
                    ////blocksint[3][0][][]
                    {
                            {0,1,0,0},
                            {0,1,0,0},
                            {1,1,0,0},
                            {0,0,0,0}
                    },
                    //反L方块状态2
                    //blocksint[3][1][][]
                    {
                            {1,0,0,0},
                            {1,1,1,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    },
                    //反L方块状态3
                    //blocksint[3][2][][]
                    {
                            {1,1,0,0},
                            {1,0,0,0},
                            {1,0,0,0},
                            {0,0,0,0}
                    },
                    //反L方块状态4
                    //blocksint[3][3][][]
                    {
                            {1,1,1,0},
                            {0,0,1,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    }
            },
            //S方块
            //blocksint[4][][][] 第一维度为表示4, S方块，后续有2种方块形态
            {
                    //S方块状态1
                    //blocksint[4][0][][]
                    {
                            {1,0,0,0},
                            {1,1,0,0},
                            {0,1,0,0},
                            {0,0,0,0}
                    },
                    //S方块状态2
                    //blocksint[4][1][][]
                    {
                            {0,1,1,0},
                            {1,1,0,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    }
            },
            //反S方块
            //blocksint[5][][][] 第一维度为表示5, 反S方块，后续有2种方块形态
            {
                    //反S方块状态1
                    //blocksint[5][0][][]
                    {
                            {0,1,0,0},
                            {1,1,0,0},
                            {1,0,0,0},
                            {0,0,0,0}
                    },
                    //反S方块状态2
                    //blocksint[5][1][][]
                    {
                            {1,1,0,0},
                            {0,1,1,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    }
            },
            //凸方块
            //blocksint[6][][][] 第一维度为表示6, 凸方块，后续有4种方块形态
            {
                    //凸方块状态1
                    //blocksint[6][0][][]
                    {
                            {0,1,0,0},
                            {1,1,1,0},
                            {0,0,0,0},
                            {0,0,0,0}
                    },
                    //凸方块状态2
                    //blocksint[6][1][][]
                    {
                            {0,1,0,0},
                            {0,1,1,0},
                            {0,1,0,0},
                            {0,0,0,0}
                    },
                    //凸方块状态3
                    //blocksint[6][2][][]
                    {
                            {0,0,0,0},
                            {1,1,1,0},
                            {0,1,0,0},
                            {0,0,0,0}
                    },
                    //凸方块状态4
                    //blocksint[6][3][][]
                    {
                            {0,1,0,0},
                            {1,1,0,0},
                            {0,1,0,0},
                            {0,0,0,0}
                    }
            }


    };//第1维表示哪种方块集合  第2维表示方块状态  第3、4维表示方块组合图
    //第1维度：0.大长条 1.大四格 2.L方块  3.反L方块 4.S方块 5.反S方块 6.凸方块

}
